## new example:

```tf
locals {
  name_prefix = "prefix"
  region = "europe-west1"
  zone = "europe-west1-b"
  continent = "eu"
  size = "n1-standard-1"
}

provider "google" {
  version = "~> 2.14"
  region = "${local.region}"
}

provider "random" {
  version = "~> 2.2"
}

resource "google_compute_address" "vm-ip" {
  lifecycle {
    prevent_destroy = true
  }
  name         = "vm-ip"
  address_type = "EXTERNAL"
  region       = "${local.region}"
}

resource "google_compute_instance" "myVM" {
  name         = "my-vm"
  allow_stopping_for_update = true
  machine_type = "${local.size}"
  zone         = "${local.zone}"

  tags = ["http-server"]
  boot_disk {
    initialize_params {
      size = "50"
      type = "pd-ssd"
      image = "debian-cloud/debian-9"
    }
  }

  network_interface {
    network = "default"
      access_config {
        nat_ip = "${google_compute_address.vm-ip.address}"
      }
  }

  metadata_startup_script =<<EOF
# cant paste my scripts
# if you change this you will trigger a recreation of the VM
EOF

  service_account {
    scopes = [
        "storage-ro",
        "logging-write",
        "monitoring-write",
        "pubsub",
        "service-management",
        "service-control",
        "https://www.googleapis.com/auth/trace.append",
      ]
  }
}

resource "google_compute_instance_group" "backends" {
  name        = "my-backend-instance-group"
  instances = [
    "${google_compute_instance.myVM.self_link}",
  ]

  named_port {
    name = "http"
    port = "80"
  }
  zone = "${local.zone}"
  depends_on = ["google_compute_instance.myVM"]
}

```

## steps to reproduce the issue:
1. create a new and empty workspace
2. terraform apply
3. change the metadata_startup_script
4. terraform apply
5. this will trigger a VM recreation.
6. check the output is different before apply and after apply

```
Plan: 1 to add, 1 to change, 1 to destroy.
Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```

## FULL OUTPUT:

```
$ terraform apply
google_compute_address.vm-ip: Refreshing state... [id=censored/europe-west1/vm-ip]
google_compute_instance.myVM: Refreshing state... [id=my-vm]
google_compute_instance_group.backends: Refreshing state... [id=europe-west1-b/my-backend-instance-group]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.myVM must be replaced
-/+ resource "google_compute_instance" "myVM" {
        allow_stopping_for_update = true
        can_ip_forward            = false
      ~ cpu_platform              = "Intel Haswell" -> (known after apply)
        deletion_protection       = false
      ~ guest_accelerator         = [] -> (known after apply)
      ~ id                        = "my-vm" -> (known after apply)
      ~ instance_id               = "8693847071612118711" -> (known after apply)
      ~ label_fingerprint         = "42WmSpB8rSM=" -> (known after apply)
      - labels                    = {} -> null
        machine_type              = "n1-standard-1"
      - metadata                  = {} -> null
      ~ metadata_fingerprint      = "eq9-G8huMnE=" -> (known after apply)
      ~ metadata_startup_script   = <<~EOT # forces replacement
            # cant paste my scripts
            # if you change this you will trigger a recreation of the VM
          + # change
        EOT
        name                      = "my-vm"
      ~ project                   = "censored" -> (known after apply)
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/censored/zones/europe-west1-b/instances/my-vm" -> (known after apply)
        tags                      = [
            "http-server",
        ]
      ~ tags_fingerprint          = "FYLDgkTKlA4=" -> (known after apply)
        zone                      = "europe-west1-b"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/censored/zones/europe-west1-b/disks/my-vm" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20191014" -> "debian-cloud/debian-9"
              ~ labels = {} -> (known after apply)
                size   = 50
                type   = "pd-ssd"
            }
        }

      ~ network_interface {
          + address            = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/censored/global/networks/default" -> "default"
          ~ network_ip         = "10.240.0.67" -> (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          ~ access_config {
              + assigned_nat_ip = (known after apply)
                nat_ip          = "34.77.21.102"
              ~ network_tier    = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      ~ service_account {
          ~ email  = "424438040152-compute@developer.gserviceaccount.com" -> (known after apply)
            scopes = [
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring.write",
                "https://www.googleapis.com/auth/pubsub",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
                "https://www.googleapis.com/auth/trace.append",
            ]
        }
    }

  # google_compute_instance_group.backends will be updated in-place
  ~ resource "google_compute_instance_group" "backends" {
        id        = "europe-west1-b/my-backend-instance-group"
      ~ instances = [
          - "https://www.googleapis.com/compute/v1/projects/censored/zones/europe-west1-b/instances/my-vm",
        ] -> (known after apply)
        name      = "my-backend-instance-group"
        network   = "https://www.googleapis.com/compute/v1/projects/censored/global/networks/default"
        project   = "censored"
        self_link = "https://www.googleapis.com/compute/v1/projects/censored/zones/europe-west1-b/instanceGroups/my-backend-instance-group"
        size      = 1
        zone      = "europe-west1-b"

        named_port {
            name = "http"
            port = 80
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Do you want to perform these actions in workspace "temporary"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_compute_instance.myVM: Destroying... [id=my-vm]
google_compute_instance.myVM: Still destroying... [id=my-vm, 10s elapsed]
google_compute_instance.myVM: Still destroying... [id=my-vm, 20s elapsed]
google_compute_instance.myVM: Still destroying... [id=my-vm, 30s elapsed]
google_compute_instance.myVM: Still destroying... [id=my-vm, 40s elapsed]
google_compute_instance.myVM: Still destroying... [id=my-vm, 50s elapsed]
google_compute_instance.myVM: Still destroying... [id=my-vm, 1m0s elapsed]
google_compute_instance.myVM: Still destroying... [id=my-vm, 1m10s elapsed]
google_compute_instance.myVM: Still destroying... [id=my-vm, 1m20s elapsed]
google_compute_instance.myVM: Destruction complete after 1m25s
google_compute_instance.myVM: Creating...
google_compute_instance.myVM: Still creating... [10s elapsed]
google_compute_instance.myVM: Creation complete after 20s [id=my-vm]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```


## RESULT:
The state is the VM is inside the instance group but the reality is that the instance group is empty.
